Tutorials/pipe/constant/distributionDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  3.0.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      distributionict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 	0.000001;

distribution 93
(
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
2.23
3.617
5.315
7.253
9.32
11.264
12.616
12.801
11.494
8.975
6.055
3.576
1.865
0.881
0.368
0.14
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
);

particleSize 93
(
0.011
0.013
0.015
0.017
0.02
0.023
0.026
0.03
0.034
0.039
0.044
0.051
0.058
0.067
0.076
0.087
0.1
0.115
0.131
0.15
0.172
0.197
0.226
0.259
0.296
0.339
0.389
0.445
0.51
0.584
0.669
0.766
0.877
1.005
1.151
1.318
1.51
1.729
1.981
2.269
2.599
2.976
3.409
3.905
4.472
5.122
5.867
6.72
7.697
8.816
10.097
11.565
13.246
15.172
17.377
19.904
22.797
26.111
29.907
34.255
39.234
44.938
51.471
58.953
67.523
77.34
88.583
101.46
116.21
133.103
152.453
174.616
200
229.075
262.376
300.518
344.206
394.244
451.556
517.2
592.387
678.504
777.141
890.116
1019.515
1167.725
1337.481
1531.914
1754.613
2009.687
2301.841
2636.467
3000
);
// ************************************************************************* //
