Tutorials/pipe/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  inlet
  {
//     type            uniformFixedValue;
//     uniformValue
//     {
//         type    tableFile;
//         file    "./dataFile.csv";
//     }
//       type            fixedValue;
//       value           uniform (0 -0.05 0);
      type          outletInlet;
      outletValue   uniform (0 0 0);
      value         $internalField;
  }
  outlet
  {
    type            zeroGradient;
  }

  wall
  {
      type            noSlip;
  }


  frontAndBack
  {
      type            empty;
  }
}



// ************************************************************************* //
